
{
    "timeline":
    {
        "headline":"Comey firing",
        "type":"default",
		"text":"Comey got fired",
		"startDate":"2017,3,1",
        "date": [
			 {
			    "startDate":"2017,3,6",
			   "endDate":"2017,3,7",
			   "headline":"Comey asked Justice officials to refute Trump’s unproven wiretapping claims",
			   "page_rank": 2,
			   "text": "<p>Here's what happened after President Trump fired off a tweet accusing former president Barack Obama of wiretapping Trump Tower before the 2016 election. (Monica Akhtar/The Washington Post)\n\nFBI Director James B. Comey asked the Justice Department this weekend to issue a statement refuting President Trump’s claim that President Barack Obama ordered a wiretap of Trump’s phones before the election, according to U.S. officials, but the department did not do so.\n\nComey made the request Saturday after Trump accused Obama on Twitter of having his “ ‘wires tapped’ in Trump Tower.” The White House expanded on Trump’s comments Sunday with a call for a congressional probe of his allegations.\n\nThe revelation, first reported by the New York Times, underscores the fraught nature of the FBI’s high-profile investigation into Russian meddling in the 2016 election. A key question fueling that inquiry is whether Trump associates colluded with Russian officials to help Trump win.\n\nNeither Justice nor the FBI would comment Sunday.\n\nThe development came as Trump’s charge against Obama — leveled without any evidence — was being rebuffed both inside and outside of the executive branch. It drew a blunt, on-the-record denial by a top intelligence official who served in the Obama administration.\n\nSpeaking on NBC News on Sunday morning, former director of national intelligence James R. Clapper Jr. denied that a Foreign Intelligence Surveillance Act (FISA) wiretap was authorized against Trump or the campaign during his tenure.\n\n“There was no such wiretap activity mounted against the president-elect at the time as a candidate or against his campaign,” Clapper said on “Meet the Press,” adding that he would “absolutely” have been informed if the FBI had received a FISA warrant against either.\n\n“I can deny it,” Clapper said emphatically.\n\nIn his claims early Saturday morning, the president tweeted that he “just found out” that Obama had “my 'wires tapped' in Trump Tower” before the election. Trump compared the alleged action to “McCarthyism.”\n\n“Is it legal for a sitting President to be ‘wire tapping’ a race for president prior to an election?” Trump asked in another tweet. “Turned down by court earlier. A NEW LOW!”\n\nBy Sunday morning, the White House doubled down on Trump’s explosive tweet storm and called for the congressional probe.\n\n[Trump, citing no evidence, accuses Obama of ‘Nixon/Watergate’ plot to wiretap Trump Tower]\n\nCurrent and former government officials said such surveillance would not have been approved by any senior Justice official in the Obama administration. And Trump’s allegation raised hackles in the FBI leadership, implying as it did that the bureau may have acted illegally to wiretap a presidential candidate without probable cause that he was an “agent of a foreign power,” as the foreign intelligence surveillance law requires.\n\n“This is Nixon/Watergate,” Trump tweeted Saturday.\n\nA spokesman for Obama countered several hours later that the former president never authorized a wiretap of Trump or any other American citizen. “Any suggestion otherwise is simply false,” the spokesman said.\n\nWhite House press secretary Sean Spicer on Sunday cited “reports” of “potentially politically motivated investigations” during the 2016 campaign, calling them “troubling.” But none of the media reports cited by the White House provides evidence of a politically motivated surveillance effort against Trump.\n\n“President Donald J. Trump is requesting that as part of their investigation into Russian activity, the congressional intelligence committees exercise their oversight authority to determine whether executive branch investigative powers were abused in 2016,” Spicer said. “Neither the White House nor the President will comment further until such oversight is conducted,” the statement added.\n\nFormer director of national intelligence James R. Clapper Jr. on March 5 denied that President Trump's 2016 campaign was wiretapped while senators of both parties weighed in on the allegations. (Bastien Inzaurralde/The Washington Post)\n\nCongressional committees in both the House and the Senate are probing not just suspected Russian efforts to undermine the 2016 election but any contacts between Russian officials and the Trump campaign.\n\nComey’s request is sure to raise eyebrows in light of his actions last year in the bureau’s investigation into Hillary Clinton’s email server.\n\nIn July he held a news conference — without telling the Justice Department what he would say — to announce that the bureau had concluded Clinton did not commit a prosecutable offense. Then, 11 days before the election, Comey wrote Congress despite warnings from senior Justice officials that doing so would violate department policy and said the FBI was examining new emails that had come to light. Nothing came of the bureau’s additional review, but Comey took heat for his actions, which Democrats say influenced the outcome of the election.\n\nIt is not clear why Comey, who is the senior-most law enforcement officer who has been overseeing the FBI investigation from its inception in the Obama administration, did not himself issue a statement to refute Trump’s claims. Nor is it clear to whom he made his request. Attorney General Jeff Sessions recused himself last week from all investigative matters related to the Trump campaign and any potential Russia links. The acting deputy attorney general, Dana Boente, a career federal prosecutor in the Eastern District of Virginia, is now overseeing the probe.\n\nTrump’s tweets early Saturday may have been prompted by the comments of a conservative radio host, which were summarized in an article on the conservative website Breitbart. The Breitbart story circulated among Trump’s senior aides on Friday.\n\n[How hard is it to get an intelligence wiretap? Pretty hard.]\n\nThe White House’s escalation of Trump’s claims were kept at arm’s length by congressional Republicans appearing on Sunday morning news broadcasts.\n\nWhen asked about Trump’s allegations, Senate Intelligence Committee member Tom Cotton (R-Ark.) declined to comment on the tweets but said he has “seen no evidence of the allegations.”\n\n“Whether that’s a FISA court application or denial of that application or a re-submission of that application, that doesn’t mean that none of these things happened. It just means we haven’t seen that yet,” Cotton added, speaking on “Fox News Sunday.”\n\nSen. Marco Rubio (R-Fla.) said he is not aware of evidence to back up the president’s claim. “I have no insight into exactly what he’s referring to,” he said on “Meet the Press.” “The president put that out there, and now the White House will have to answer for exactly what he was referring to.”\n\nObama’s allies were more blunt, denying flatly that the former president had ordered a wiretap of Trump’s campaign.\n\n“This may come as a surprise to the current occupant of the Oval Office, but the president of the United States does not have the authority to unilaterally order the wiretapping of American citizens,” said former Obama White House press secretary Josh Earnest.\n\n\n\nSenate Minority Leader Charles E. Schumer (D-N.Y.) told “Meet the Press” that Trump is “in trouble” and acting “beneath the dignity of the presidency.”\n\n“The president’s in trouble if he falsely spread this kind of information,” Schumer said. “It shows this president doesn’t know how to conduct himself.”\n\nEarnest added that Trump was attempting to distract from the controversy involving contacts between his campaign aides, including now-Attorney General Jeff Sessions, and Russian officials.\n\n“We know exactly why president Trump tweeted what he tweeted,” Earnest added. “Because there is one page in the Trump White House crisis management playbook, and that is simply to tweet or say something outrageous to distract from a scandal. And the bigger the scandal, the more outrageous the tweet.”\n\n[The one big question Jeff Sessions still hasn’t answered]\n\nBut appearing on ABCs “This Week,” White House deputy press secretary Sarah Huckabee Sanders repeatedly said that the president’s allegation was worth looking into.\n\n“He’s asking that we get down to the bottom of this, let’s get the truth here, let’s find out,” Huckabee Sanders said. “I think the bigger story isn’t who reported it, but is it true. And I think the American people have a right to know if this happened, because if it did, again, this is the largest abuse of power that, I think, we have ever seen.”\n\nAsked whether Trump truly believes Obama wiretapped him, Huckabee Sanders deflected.\n\n“I would say that his tweet speaks for itself there,” she said.\n\nClapper’s comments referred only to whether Trump campaign officials had been wiretapped. But their conversations could also have been captured by routine surveillance of Russian diplomats or intelligence operatives.\n\nU.S. monitoring of Russian Ambassador Sergey Kislyak, for example, caught his conversations with Trump adviser Michael Flynn during the campaign. Flynn went on to become Trump's national security adviser, but he was forced to resign last month after admitting that he had misled other senior Trump officials about the nature of those conversations.\n\nThe FBI and the National Security Agency also have obtained intercepted communications among Russians officials in which they refer to conversations with members of the Trump team, current and former U.S. officials have said.\n\nOn the broader question of apparent Russian interference in the 2016 election, Clapper urged congressional investigators to attempt to settle the issue, which he said has become a “distraction” in the political sphere.\n\nThe intelligence community found no evidence of collusion between the Trump campaign and the Russian government — at least until the end of the Obama administration, he said Sunday.\n\n“We had no evidence of such collusion,” he said on “Meet the Press.” But Clapper added a caveat: “This could have unfolded or become available in the time since I left government.”\n\nWhether there was any collusion is a key question fueling a wide-ranging federal probe into Russian interference in the 2016 presidential campaign.\n\nOn Jan. 6, the U.S. spy agencies collectively released a report concluding that Russia carried out cyberhacks and other “active measures” with an intent to help Trump and harm the campaign and potential presidency of Hillary Clinton. The report, Clapper pointed out, included “no evidence” of collusion with the Trump campaign.\n\nBut the investigation by the FBI, the NSA and the CIA continues. The Senate and House intelligence committees also are conducting investigations.\n\nAaron Blake, Greg Jaffe, Robert Costa, Sari Horwitz, Greg Miller and Matt Zapotosky contributed to this report.</p>",
			   "asset": {
				  "media": "the-washington-post.png",
				  "credit": "The Washington Post",
				  "caption": ""
			   }
			},
			 {
			   "startDate": "2017,3,20",
			   "endDate": "2017,3,20",
			   "headline": "Comey faces public hearing on Russian interference, alleged Trump wiretap",
			   "page_rank": 1,
			   "text": "<p>FBI Director James Comey and the director of the National Security Agency, Adm. Mike Rogers, will be questioned by members of the House Intelligence Committee this morning, in one of the most anticipated hearings in recent memory on Capitol Hill.\n\nThere’s been a lot of speculation about what Director Comey will say about wiretaps and Russian meddling in the election -- and today, we will hear from him directly. For two weeks Comey has been urging the Justice Department to publicly reject the president’s wiretapping claim. Since that hasn’t happened, this morning he is expected to do it himself early on in the hearing.\n\nHe is also likely to be asked about possible criminal investigations into people close to the president over ties to Russia.\n\nThe hearing is scheduled to begin at 10 a.m. ET.\n\nComey will face tough questions -- from both Republicans and Democrats -- on the FBI investigation into Russian interference in the campaign. In January the U.S. intelligence community issued a report stating the CIA, FBI and NSA concluded that Russian President Vladimir Putin ordered a campaign involving covert intelligence operations and overt propaganda to undermine the 2016 U.S. election, in order to suppress support for Hillary Clinton and to aid Mr. Trump.\n\nComey also will be asked whether there is any evidence Trump Tower was wiretapped by the Obama administration, as originally alleged by President Trump in a series of tweets, and in an interview with Fox News’ Tucker Carlson.\n\n“Wiretap covers a lot of different things,” Mr. Trump said on March 15. “I think you’re going to find some very interesting items coming to the forefront over the next two weeks.”\n\nCBS News\n\nBut on Sunday, the Chairman of the House Intelligence Committee, Republican Devin Nunes, said the evidence he’s seen suggests otherwise. “Was there a physical wiretap of Trump Tower? No,” Nunes said on Fox News. “There never was.”\n\nBut the panel’s ranking Democrat says that documents the Justice Department and FBI delivered late last week to the committee offers circumstantial evidence that American citizens colluded with Russians in Moscow’s efforts to interfere in the presidential election.\n\n“There was circumstantial evidence of collusion; there is direct evidence, I think, of deception,” Rep. Adam Schiff, D-Calif., said on NBC’s “Meet the Press.” ‘’There’s certainly enough for us to conduct an investigation.”\n\nThe Trump administration is also not backing down after it recently cited an unsubstantiated report claiming British intelligence may have helped President Obama tap Trump Tower. Over the weekend, a former U.K. ambassador to the United States accused the administration of “peddling falsehoods.”\n\nRepublican Congressman Will Hurd, of Texas, suggested Mr. Trump apologize for the accusations.\n\n“It never hurts to say you’re sorry,” he said on ABC News’ “This Week.” “And it’s not just sorry to the president, but also to the U.K. for the claims, or the intimation, that the U.K. was involved in this as well. And it takes away from the rest of his agenda.”\n\nThere will be limits to what Director Comey can reveal. Typically the FBI does not comment on ongoing investigations. When Director Comey broke with protocol during the election to speak openly about the Clinton email server investigation, he was accused of playing politics.\n\nAmong some Members of Congress, Comey’s reputation is still under repair.\n\nAt a hearing in January, Comey refused to confirm or deny the existence of any investigation exploring possible connections between Trump associates and Russia, consistent with the FBI’s longstanding policy of not publicly discussing its work. His appearances on Capitol Hill since then have occurred in classified settings, often with small groups of lawmakers, and he has made no public statements connected to the Trump campaign or Russia.\n\nBut Comey may feel compelled to respond to Mr. Trump’s unproven Twitter assertions. President Obama’s top intelligence official, James Clapper, has publicly called the claims false.\n\nEarlier this month, Rep. Elijah Cummings, D-Md., released documents that show Mr. Trump’s former national security adviser, Michael Flynn, was paid more than $67,000 from Russia companies before the presidential election, including $33,750 from Russia’s government-run television station to appear at an event in Moscow in December 2015.\n\nThe Senate Intelligence Committee has scheduled a hearing for later in the month.</p>",
			   "asset": {
				  "media": "\"cbs-news.png\"",
				  "credit": "CBS News",
				  "caption": "\"\""
			   }
			},
			 {
			   "startDate": "2017,5,3",
			   "endDate": "2017,5,3",
			   "headline": "<strong>FBI director Comey troubled that he might have influenced election, but would not change what he did</strong>",
			   "page_rank": 1,
			   "text": "<p>(CNN) FBI Director James Comey strongly defended Wednesday his decision to alert Congress just days before the 2016 election about his agency's investigation into emails potentially related to Hillary Clinton's personal server, telling senators while the idea of impacting the election made him \"mildly nauseous,\" he would not change what he did.\n\n\"It was a hard choice, I still believe in retrospect the right choice,\" Comey told senators at a judiciary committee hearing on oversight of his agency . \"I can't consider for a second whose political fortunes will be affected.\"\n\nComey faced sharp questions from both sides of the aisle and is testifying the day after both the sitting US President and the 2016 Democratic presidential nominee sharply criticized him for his role in the outcome of last year's presidential election.\n\nHe also said Russia to this day is actively involved in trying to influence US politics, emboldened after the outcome of last year's election.\n\n\"I think one of the lessons that the Russians may have drawn from this is: this works,\" Comey said.\n\nCommittee Chairman Chuck Grassley originally called the Wednesday oversight hearing of the FBI to examine what the agency knows about a 2015 terrorist attack in Garland, Texas . But the broad oversight hearing almost immediately shifted to the FBI's investigation into Russian meddling in the US elections, a subject on which there are four congressional probes in progress that have led to a steady stream of revelations since President Donald Trump was elected.\n\nComey has become an almost equally divisive figure for Republicans and Democrats for his impact on the 2016 elections.\n\n\"A cloud of doubt hangs over the FBI's objectivity,\" Grassley said in his opening remarks, which listed a series of issues he took with the agency. The Iowa Republican added later, \"The public's faith in the FBI, Congress, and our democratic process has been tested lately.\"\n\nComey cited the meeting on the tarmac between former President Bill Clinton and then-Attorney General Loretta Lynch last year as a sign he was worried about leadership at the Justice Department's handling of its investigation.\n\n\"I'm not picking on the attorney general, Loretta Lynch, who I like very much, but her meeting with President Clinton on that airplane was the capper for me and I then said, you know what, the department cannot, by itself, credibly end this,\" Comey told the committee.\n\nComey's revelation that the FBI was examining additional emails from Hillary Clinton that were discovered on disgraced former Rep. Anthony Weiner's computer, has led Democrats -- including Clinton herself -- to say it cost them the White House.\n\n\"I was on the way to winning until a combination of Jim Comey's letter on October 28 and Russian WikiLeaks raised doubts in the minds of people who were inclined to vote for me and got scared off,\" the 2016 Democratic presidential nominee said Tuesday in an interview conducted by CNN's Christiane Amanpour at the Women for Women International summit in New York.\n\nRanking Democrat Dianne Feinstein used her first remarks to question the agency's timing and handling the Clinton investigation.\n\n\"Why didn't you just do the investigation as you would normally, with no public announcement?\" the California Democrat asked.\n\n\"Having repeatedly told this Congress we're done and there's nothing there, there's no case there, there's no case there, to restart in a hugely significant way, potentially finding the emails that would reflect on her intent from the beginning and not speak about it would require an act of concealment in my view,\" Comey responded as part of his lengthy answer explaining his letter to Congress.\n\nMost recently, CNN reported Tuesday that former acting Attorney General Sally Yates is prepared to testify before a Senate panel next week that she gave a forceful warning to the White House regarding then-national security adviser Michael Flynn and his conversations with the Russians nearly three weeks before he was fired, contradicting the administration's version of events. Comey, responding to a question Wednesday from Republican Sen. Lindsey Graham, confirmed Yates discussed her assessment that Flynn may be vulnerable with him.\n\nFollowing those remarks, Trump criticized Comey the night before the hearing.\n\n\"FBI Director Comey was the best thing that ever happened to Hillary Clinton in that he gave her a free pass for many bad deeds! The phony......Trump/Russia story was an excuse used by the Democrats as justification for losing the election. Perhaps Trump just ran a great campaign?\" Trump said in a pair of tweets Tuesday.\n\nFBI Director Comey was the best thing that ever happened to Hillary Clinton in that he gave her a free pass for many bad deeds! The phony... — Donald J. Trump (@realDonaldTrump) May 3, 2017\n\n...Trump/Russia story was an excuse used by the Democrats as justification for losing the election. Perhaps Trump just ran a great campaign? — Donald J. Trump (@realDonaldTrump) May 3, 2017\n\nSenate Democrats grilled the FBI chief about his decisions in the final days of the US election last year and his timing for releasing that information.\n\n\"The most important investigation the FBI is currently conducting is into Russia's interference in our last presidential election,\" Sen. Chris Coons, a Delaware Democrat on the Senate judiciary committee, told CNN Tuesday. \"This isn't just about understanding Russian interference and potential coordination of some kind with the Trump campaign. This is about defending our next election as well.\"\n\nMeanwhile, Graham, who is leading his own investigation into Russia's interference in the election, said he still wants Comey to answer whether the FBI issued any warrants against the Trump campaign -- a question he asked months ago.\n\n\"I just want an answer. I just want to know what is going on here,\" Graham said Tuesday. \"You had (former Director of National Intelligence James) Clapper say there was no surveillance of the Trump campaign or Trump Tower. You've got press reports a FISA warrant was issued for Carter Page because of his ties to Russia. I just want to know what happened. And if we can't do it in an open session, let's do it in a closed session.\"</p>",
			   "asset": {
				  "media": "cnn.png",
				  "credit": "CNN",
				  "caption": ""
			   }
			},
			 {
			   "startDate": "2017,5,9",
			   "endDate": "2017,5,9",
			   "headline": "Trump fires FBI director Comey",
			   "page_rank": 4,
			   "text": "<p>AFP/File / JIM WATSON FBI Director James Comey, the man who leads the agency charged with investigating President Donald Trump's campaign ties with Russia, has been fired by the president US President Donald Trump on Tuesday fired his FBI director James Comey, the man who leads the agency charged with investigating his campaign's ties with Russia -- a move that sent shockwaves through Washington. The surprise dismissal of Comey, who played a controversial role in the 2016 presidential election, came as he was leading a probe into whether Trump's aides colluded with Moscow to sway the vote. \"The president has accepted the recommendation of the attorney general and the deputy attorney general regarding the dismissal of the director of the Federal Bureau of Investigation,\" White House spokesman Sean Spicer told reporters.\n\nA search for a new FBI director was to begin \"immediately,\" the White House said in a statement.\n\nIn a letter, Trump told Comey: \"You are hereby terminated and removed from office, effective immediately.\"\n\n\"While I greatly appreciate you informing me, on three separate occasions, that I am not under investigation, I nevertheless concur with the judgment of the Department of Justice that you are not able to effectively lead the Bureau.\"\n\n\"It is essential that we find new leadership for the FBI that restores public trust and confidence in its vital law enforcement mission,\" Trump said.\n\nFBI directors are appointed for a single 10-year term. The 56-year-old Comey, who is popular among rank-and-file agents, was appointed four years ago.\n\nDemocrat Hillary Clinton accused Comey of trashing her chances of becoming president by revealing an renewed investigation into her email use.\n\nHis dismissal will raise questions about Trump's motives.\n\nIt will also prompt parallels with Richard Nixon's decision to unceremoniously fire his attorney general, an event that plunged his presidency deeper into crisis.\n\n- Russia probe -\n\nIn March, Comey revealed that the agency is investigating Russian interference in last year's presidential election and notably Moscow's possible collusion with President Donald Trump's campaign.\n\nDuring testimony to Congress, he also flatly rejected Trump's explosive claim that he was wiretapped by his predecessor Barack Obama.\n\nAFP / MANDEL NGAN A copy of the termination letter to FBI Director James Comey from US President Donald Trump is seen at the White House on May 9, 2017 in Washington, DC\n\nThe explosive testimony in the House Intelligence Committee -- the first public hearing into both controversies -- came as Trump sought to steer the news focus by calling the Russia issue, which has been a cloud over his November victory, \"fake news.\" Republicans pointed to Comey's recent misstatement to Congress about Clinton forwarding emails to an aide as a possible reason for his dismissal. \"Given the recent controversies surrounding the director, I believe a fresh start will serve the FBI and the nation well,\" said Senator Lindsey Graham.\n\n\"I encourage the president to select the most qualified professional available who will serve our nation's interests.\"\n\nDemocrats -- already angry that Congressional inquiries have been hamstrung by Republicans' willingness to defend Trump -- worried that the FBI's investigation may also be in jeopardy\n\n\"Congressional Republicans cannot possibly disagree now: the only fix to this mess is an independent commission with subpoena power,\" said Brian Fallon, a former Justice Department and Hillary Clinton spokesman.</p>",
			   "asset": {
				  "media": "\"agence-france-presse.png\"",
				  "credit": "Agence France-Presse",
				  "caption": "\"\""
			   }
			},
			 {
			   "startDate": "2017,5,10",
			   "endDate": "2017,5,10",
			   "headline": "The FBI says Comey overstated the number of emails Clinton aide forwarded",
			   "page_rank": 4,
			   "text": "<p>FBI Director James Comey grossly overstated to Congress the number of emails Hillary Clinton aide Huma Abedin forwarded to husband Anthony Weiner while working at the State Department, the FBI said in a letter to the Senate Judiciary Committee on Tuesday.\n\nThe letter was released just moments before the White House announced President Donald Trump had dismissed Comey.\n\nComey told the panel last week that Abedin forwarded \"hundreds and thousands of emails\" to her spouse, to print when Clinton served as secretary of state.\n\n\"Somehow, her emails were being forwarded to Anthony Weiner, including classified information,\" he said.\n\nBut a clarification sent from the FBI on Tuesday said only two email chains containing classified information were manually forwarded from Abedin to Weiner. Ten other chains with classified information were also found on Weiner's laptop, but are believed to be the product of a backup of her personal electronic device.\n\nAll 12 of the email chains had previously been discovered during the FBI's investigation, the letter stated.\n\nThe discovery of Comey's misstatement was first reported by ProPublica.\n\nComey revealed the seemingly new information while defending his decision to renew the FBI investigation into Clinton's private email server just days before the 2016 presidential campaign. Less than two weeks before election day, the FBI informed Congress new Clinton emails had been found on a laptop belonging to Weiner.\n\nPlay Facebook\n\nTwitter\n\nEmbed FBI's James Comey defends his handling of Clinton email investigation 3:33 autoplay autoplay Copy this code to your website or blog\n\nThough Clinton was again cleared of any criminal wrongdoing before Election Day, Democrats pointed to the surprise announcement as part of the reason why she was defeated.\n\nComey said at the hearing it makes him \"mildly nauseous\" to think he played a role in the outcome of the election.\n\nClinton also pointed to the Oct. 28 letter as major factor in her stunning loss.\n\n\"If the election had been on October 27, I would be your president,\" she said at a forum last week.</p>",
			   "asset": {
				  "media": "\"nbc-news.png\"",
				  "credit": "NBC News",
				  "caption": "\"\""
			   }
			},
			 {
			   "startDate": "2017,5,10",
			   "endDate": "2017,5,10",
			   "headline": "The Latest: Timing of Comey firing troubles Intel chair",
			   "page_rank": 2,
			   "text": "<p>WASHINGTON (AP) — The Latest on the firing of FBI Director James Comey (all times local):\n\n8 p.m.\n\nThe Senate Republican leading the investigation into potential ties between Russia and the Trump campaign says he's \"troubled by the timing and reasoning\" behind President Donald Trump's firing of FBI Director James Comey.\n\nSen. Richard Burr, who chairs the Intelligence committee, said he found Comey to a public servant of the highest order, and his dismissal \"further confuses an already difficult investigation\" by his panel.\n\nBurr said Comey was the most forthcoming with information of any FBI director that Burr could recall.\n\nThe North Carolina senator called Comey's firing \"a loss for the bureau and the nation.\"\n\n___\n\n7:35 p.m.\n\nThe head of a professional association of FBI agents says a change in leadership at the law enforcement agency should be handled carefully.\n\nFBI Agents Association President Thomas O'Connor says the change should be made with an eye toward ensuring the agency can \"continue to fulfill its responsibility to protect the American public from criminal and national security threats.\"\n\nHe says agents want a voice in the selection process.\n\nThe organization says it appreciated Comey's service and leadership. O'Connor says the fired FBI director \"understood the centrality of the agent to the bureau's mission\" and knew agents risk their lives daily.\n\nO'Connor says Comey ensured the FBI's investigations were constitutional and that agents \"performed their mission with integrity and professionalism.\"\n\n___\n\n7:30 p.m.\n\nA White House official says President Donald Trump's former bodyguard and director of Oval Office operations hand-delivered the White House's letter to the FBI terminating FBI director James Comey.\n\nThe White House official says Keith Schiller delivered the letters from the president and top Justice Department officials. The official spoke on condition of anonymity to describe Schiller's activities.\n\nVideo of Schiller outside FBI headquarters was aired by CNN. Comey was traveling to an event in Los Angeles at the time.\n\nSchiller is a former detective with the New York Police Department who worked for Trump's security team for nearly two decades before joining the administration.\n\n— Contributed by Ken Thomas.\n\n___\n\n7:25 p.m.\n\nRepublican John McCain says Congress must form a special committee to investigate Russia's interference in the 2016 election following President Donald Trump's firing of FBI Director James Comey.\n\nThe Arizona senator said he has long called for a special congressional committee to investigate Russian interference in the election and said Trump's decision to remove Comey \"only confirms the need and the urgency of such a committee.\"\n\nMcCain said he was disappointed in Trump's decision, calling Comey a man of honor and integrity who led the FBI well in extraordinary circumstances.\n\nRepublican Sen. Bob Corker of Tennessee said Comey's dismissal \"will raise questions\" and said \"it is essential that ongoing investigations are free of political interference until their completion.\"\n\nHe said Trump must nominate a well-respected person to replace Comey.\n\n___\n\n7:25 p.m.\n\nThe top Democrat in the Senate says he told Donald Trump \"you are making a big mistake\" when the president called to inform him that he was firing FBI Director James Comey.\n\nNew York Sen. Chuck Schumer told reporters Tuesday night that he received a call from the president.\n\nSchumer questioned why the firing occurred on Tuesday and wondered whether investigations into the Trump campaign's possible ties to Russia were \"getting too close to home for the president.\"\n\nHe called on the deputy attorney general to appoint a special prosecutor.\n\nSaid Schumer: \"This investigation must be run as far away as possible\" from the president.\n\n___\n\n7:20 p.m.\n\nThe vice chairman of the Senate Intelligence Committee called President Donald Trump's firing of FBI Director James Comey \"shocking\" and deeply troubling.\n\nSen. Mark Warner said it's especially so because it comes during an active FBI investigation into possible improper contacts between Trump's campaign and Russia.\n\nThe Virginia Democrat is helping lead a Senate investigation into Russian interference in the 2016 election. He says Comey's firing comes after he dismissed acting Attorney General Sally Yates and nearly every U.S. attorney.\n\nWarner said Trump's actions \"make it clear to me that a special counsel also must be appointed\" to investigate the Trump campaign's ties to Russia. He said an independent investigation is the only way the American people will be able to trust the results of an investigation.\n\n___\n\n7:05 p.m.\n\nDeputy Attorney General Rod Rosenstein says former Justice Department officials agree FBI Director James Comey mishandled the Hillary Clinton email investigation.\n\nRosenstein says the FBI is \"unlikely to regain public and congressional trust until it has a director who understands the gravity of the mistakes\" and promises not to repeat them. He made the comments in a memo titled \"Restoring Public Confidence in the FBI.\"\n\nRosenstein says Comey has refused to admit his errors and \"cannot be expected to implement necessary corrective actions.\"\n\nPresident Donald Trump says he fired Comey Tuesday based in part on Rosenstein's memo.\n\n___\n\n7:05 p.m.\n\nMore Democrats are renewing calls for a special prosecutor following President Donald Trump's firing of FBI Director James Comey amid a complex counterintelligence investigation into Trump's campaigns' possible ties with Russia.\n\nMassachusetts Sen. Edward Markey and Pennsylvania Sen. Bob Casey say the dismissal is reminiscent of the Watergate scandal and the national turmoil during that time.\n\nMaryland Rep. Elijah Cummings says Congress needs to have immediate emergency hearings. Cummings says Comey was the one independent person to investigate Trump and his campaign's possible coordination with Russia.\n\n___\n\n7:05 p.m.\n\nDeputy Attorney General Rod Rosenstein says FBI Director James Comey's public announcement that Hillary Clinton should not face criminal charges over her emails was a \"textbook example of what federal prosecutors and agents are taught not to do.\"\n\nRosenstein says in a Tuesday memo that Comey was wrong to announce his own conclusions about \"the nation's most sensitive criminal investigation\" without approval from Justice Department leaders.\n\nHe says federal prosecutors should have made a decision on whether to charge Clinton.\n\nComey has defended his announcement on reopening of the probe just before Election Day, saying \"concealing\" it from Congress would have been worse. But Rosenstein says that's a loaded term and \"silence is not concealment.\"\n\nHe says federal agents have a policy of not speaking publicly.\n\n___\n\n7:05 p.m.\n\nA former top aide to Hillary Clinton's presidential campaign says President Donald Trump's firing of FBI Director James Comey is \"related to Russia, not related to Clinton.\"\n\nClinton's spokesman during her 2016 presidential bid, Brian Fallon, said Tuesday that \"the timing and manner of this firing suggests that it is the product of Donald Trump feeling the heat on the ongoing Russia investigation, and not a well-thought-out response to the inappropriate handling of the Clinton investigation.\"\n\nIn announcing the firing, the White House circulated a memo written by deputy Attorney General Rod Rosenstein, criticizing Comey's handling of an investigation into Clinton's email practices.\n\nFallon said the administration is \"falsely citing the very thing that propelled him to the presidency as a convenient excuse\" for firing someone \"conducting an aggressive investigation into his campaign's connections to the Russian government.\"\n\n___\n\n7 p.m.\n\nTwo Democratic senators are criticizing President Donald Trump's decision to fire the FBI director in the middle of an investigation into the president's associates' ties with Russia.\n\nOregon Sen. Ron Wyden says Trump's decision is \"outrageous.\" Wyden says FBI Director James Comey should be immediately called to testify about the status of the Russia investigation.\n\nRhode Island Sen. Sheldon Whitehouse says the timing of Comey's firing \"raises massive questions.\"\n\nBoth Wyden and Whitehouse are members of Senate committees that are doing their own investigations into the Trump campaign's ties with Russia.\n\n___\n\n6:50 p.m.\n\nDeputy Attorney General Rod Rosenstein says FBI Director James Comey was wrong to announce his conclusion that the investigation into whether Hillary Clinton mishandled classified information should be closed without criminal charges.\n\nRosenstein says in a memo that Comey usurped the authority of then-Attorney General Loretta Lynch by announcing his findings. Comey was fired Tuesday.\n\nRosenstein says Comey should have said the FBI had completed its investigation, then presented its findings to prosecutors.\n\nRosenstein says Comey instead held a news conference \"to release derogatory information about the subject of a declined criminal investigation.\" Comey had said Clinton should not be charged but criticized her work habits.\n\nRosenstein says Comey \"laid out his version of the facts for the news media as if it were a closing argument, but without trial.\"\n\n___\n\n6:40 p.m.\n\nSenate Judiciary Chairman Charles Grassley says dismissed FBI Director James Comey had lost the \"public trust and confidence.\"\n\nPresident Donald Trump abruptly fired Comey Tuesday. Grassley said Comey's decisions on controversial matters \"have prompted concern from across the political spectrum\" and from career law enforcement experts.\n\nGrassley criticized Comey's investigation into Democrat Hillary Clinton's email practices, saying the FBI was slow to answer questions from his committee.\n\nGrassley said: \"The effectiveness of the FBI depends upon the public trust and confidence. Unfortunately, this has clearly been lost.\"\n\n___\n\n6:35 p.m.\n\nAttorney General Jeff Sessions says James Comey was fired from his post as FBI director because the law enforcement agency needs a \"fresh start.\"\n\nIn a letter addressed to President Donald Trump and released by the White House, Sessions says the FBI director must be someone who follows \"faithfully the rules and principles\" of the Justice Department. Sessions also says the individual must be someone who \"sets the right example\" for law enforcement officials and others in the department.\n\nSession did not go into detail in the one-page letter dated Tuesday in which he recommended to Trump that Comey be removed as FBI director.\n\nWhite House press secretary Sean Spicer announced Tuesday that Trump had fired Comey.\n\nSpicer says the search for a new FBI director was beginning immediately.\n\n___\n\n6:30 p.m.\n\nDemocrats are insisting on an independent prosecutor to investigate possible links between the Trump campaign and Russia following FBI Director James Comey's firing.\n\nSen. Kamala Harris of California tweets: \"I've said it before and will again — we must have a special prosecutor to oversee the FBI's Russia investigation. This cannot wait.\"\n\nRep. Steve Cohen of Tennessee said \"our democracy is in danger,\" and he pressed Speaker Paul Ryan to appoint a bipartisan commission to investigate the Trump-Russia relationship.\n\nSen. Dick Durbin, the No. 2 Democrat in the Senate, stood on the Senate floor and said he would await word from the White House on whether the investigation will continue.\n\nSen. Bob Casey of Pennsylvania called on Deputy Attorney General Rod Rosenstein to appoint a special counsel.\n\n___\n\n6:20 p.m.\n\nPresident Donald Trump called at least two members of the Senate Judiciary Committee minutes before the White House announced the dismissal of FBI Director James Comey on Tuesday.\n\nRepublican Sen. Lindsey Graham of South Carolina and Democratic Sen. Dianne Feinstein of California both said they received calls from Trump. Graham is heading the panel's probe into Russian interference in the 2016 presidential election and Feinstein is the top Democrat on the committee.\n\nNeither senator criticized the decision. Graham was supportive, saying that \"given the recent controversies surrounding the director, I believe a fresh start will serve the FBI and the nation well.\"\n\nFeinstein said Trump told her the FBI needed a change, and that the next director \"must be strong and independent.\"\n\n___\n\n5:46 p.m.\n\nPresident Donald Trump abruptly fired FBI Director James Comey Tuesday, ousting the nation's top law enforcement official in the midst of an investigation into whether Trump's campaign had ties to Russia's election meddling.\n\nIn a letter to Comey, Trump said the firing was necessary to restore \"public trust and confidence\" in the FBI. Comey has come under intense scrutiny in recent months for his role in an investigation into Democrat Hillary Clinton's email practices, including a pair of letters he sent to Congress on the matter in the closing days of last year's election.\n\nTrump made no mention of Comey's role in the Clinton investigation. But the president did assert that Comey informed him \"on three separate occasions that I am not under investigation.\"</p>",
			   "asset": {
				  "media": "\"associated-press.png\"",
				  "credit": "Associated Press",
				  "caption": "\"\""
			   }
			},
			 {
			   "startDate": "2017,5,10",
			   "endDate": "2017,5,10",
			   "headline": "Absolutely nothing about James Comey's firing passes the smell test",
			   "page_rank": 2,
			   "text": "<p>In some other universe, Americans might be able to take at face value the Trump administration’s explanation for the abrupt firing of James B. Comey less than four years into his 10-year term as director of the FBI — that Comey had mishandled the investigation into Hillary Clinton’s use of a private email server as secretary of State.\n\nBut in the real universe, that explanation seems far-fetched. After all, Comey is the official who has been supervising an investigation into possible links between Russia and the campaign of the very president who just fired him. That president, by the way, tweeted this on Monday: “The Russia-Trump collusion story is a total hoax, when will this taxpayer funded charade end?” Americans can be excused for wondering if Trump hopes that Comey’s departure from the scene is the answer to his question.\n\nBesides, most of the conduct that supposedly led to Comey’s dismissal — detailed in a memo by Deputy Atty. Gen. Rod J. Rosenstein that was released Tuesday by the administration — has been a matter of public discussion for months and was known to Trump and Atty. Gen. Jeff Sessions when they took office.\n\nYou can be critical of some of Comey’s actions in connection with the Clinton email investigation and still be alarmed by the way he has been removed.\n\nThat includes Comey’s decision last July to hold a news conference to announce that he wasn’t recommending that Clinton be charged criminally for mishandling classified information, his characterization of her conduct as “extremely careless” and his sending of a letter to Congress 11 days before the election — which quickly became public — saying that the FBI had “learned of the existence of emails that appear to be pertinent to the investigation” into Clinton’s private email server. (Two days before the election, Comey said that the new emails hadn’t changed the FBI’s earlier conclusion.)\n\nEven though all that information was well-known at the time, Trump told Comey in late January that he would be kept on as FBI director. So why the sudden decision to fire him now?\n\nIt’s true that in testimony before the Senate Judiciary Committee last week, Comey offered a combative defense of his actions, including a claim that when he learned of possibly relevant emails on a laptop owned by Anthony Weiner, husband of Clinton aide Huma Abedin, he faced a choice between speaking and concealing. But that argument wasn’t new either. In his memo, Rosenstein lacerates Comey for making this same argument in a letter to Congress last October.\n\nYou can be critical of some of Comey’s actions in connection with the Clinton email investigation — as this page was — and still be alarmed by the way he has been removed by a president who has his own reasons for wanting to see Comey gone.\n\nNor does the timing of the dismissal seem to be explained by the fact that Rosenstein, a respected career prosecutor, only recently joined the Justice Department, having been confirmed on April 25. The department has other officials responsible for investigating misconduct, including an inspector general who was investigating Comey’s actions in connection with the Clinton investigation. There was no mention of any findings by the inspector general in the White House or Justice Department announcements.\n\nFrankly, the Comey firing is deeply troubling, reminiscent of Richard Nixon’s forcing out of special Watergate prosecutor Archibald Cox in 1973. Like Comey, Cox was investigating the president. That infamous series of moves is known as the Saturday Night Massacre.\n\nNow that Comey is gone there are two urgent priorities that Congress must insist on in its oversight role.\n\nOne is to preserve the integrity of the Justice Department investigation into Russian meddling in the presidential election and the possibility of collusion between Russia and members of the Trump campaign. Because Sessions has recused himself from involvement in that matter, it’s up to Rosenstein to decide whether to appoint a special counsel to direct that investigation; he should do so immediately. The integrity of the investigation is in peril. Comey had a reputation for independence, and unlike Rosenstein or Sessions, he was not appointed by Trump.\n\nSecond, it is imperative that Comey’s replacement be a professional law enforcement official with an impeccable reputation, familiarity with federal law enforcement, no taint of partisanship and no political, personal or business connection to Trump. The Senate should refuse to confirm anyone who falls short of that ideal.\n\nRead our Trump Editorial Series\n\nWhy We Took a Stand on Trump\n\nWhy now? The answer is simple. There is good reason to believe that rather than grow into the job, he’ll remain the man he was on the campaign trail — impulsive, untruthful, narcissistic, ignorant of the limits on presidential power and woefully unprepared to wield it.\n\nFollow the Opinion section on Twitter @latimesopinion and Facebook</p>",
			   "asset": {
				  "media": "\"la-times.png\"",
				  "credit": "Los Angeles Times",
				  "caption": "\"\""
			   }
			},
			 {
			   "startDate": "2017,5,14",
			   "endDate": "2017,5,14",
			   "headline": "Former DNI Clapper says Russia likely sees Comey's firing as 'another victory'",
			   "page_rank": 1,
			   "text": "<p>Former Director of National Intelligence James Clapper said Russia likely sees President Trump's firing of FBI Director James Comey as \"another victory on the scoreboard for them.\"\n\n“What's unfolded now, here, the leader of the -- the lead of the investigation about potential collusion between Russia and the Trump campaign has been removed. So the Russians have to consider this as a, you know, another victory on the scoreboard for them,” Clapper told ABC News’ Chief Anchor George Stephanopoulos on “This Week” Sunday.\n\nClapper also told Stephanopoulos that then-FBI Director Comey seemed \"uneasy\" about having dinner with President Trump because of \"the appearance of potentially compromising his independence.\" The former DNI noted he spoke to Comey at FBI headquarters ahead of the dinner on Jan. 27, a week after Trump took office.\n\n“I spoke briefly with Director Comey about the dinner,\" Clapper said. \"He conveyed to me that he’d been invited and he was -- and this is my characterization -- uneasy with it, simply because of the optic or the appearance of potentially compromising his independence and that of the bureau.”\n\nBut he said it’s a “professional courtesy” to accept an invitation from the president for dinner.\n\nStephanopoulos asked the former Director of National Intelligence under President Obama if he thought “James Comey would make a pledge of loyalty to the president,” a reference to reports that Comey said the president asked him for such assurances, which he declined to give.\n\nClapper said he “would find that profoundly out of character for what” he knows of Comey “and his integrity” that the former FBI chief would make such a pledge.\n\nTrump is disputing reports that he asked Comey for loyalty. “No. No, I didn't [ask him]. But I don't think it would be a bad question to ask,\" Trump said in an interview on Fox News on Saturday night.\n\nThe Trump administration has been citing previous statements by Clapper to assert that there is no evidence that Trump associates colluded with Russia in Moscow’s meddling in the 2016 election.\n\nSpeaking on Capitol Hill on Wednesday, Vice President Mike Pence said, “The facts that are in public today are very clear. The former Director of National Intelligence has said that there is no evidence of collusion.”\n\nStephanopoulos asked Clapper, “You did say back in your original testimony [to Congress] that you hadn’t seen evidence of collusion. Tell us exactly what you think right now.”\n\nClapper said Sunday, “At the time we did our intelligence community assessment [of Russian interference in the election], which we published publicly on the 6th of January, there was no evidence of any collusion included in that report.”\n\nBut he said the FBI, which is conducting the Russia probe as a counterterrorism investigation, would not necessarily have told the Director of National Intelligence if it found evidence of such collusion.\n\n“I had no evidence available to me that there was collusion, but that's not necessarily exculpatory since I did not know the state of the investigation or the content -- what had been turned up with it,” Clapper said.</p>",
			   "asset": {
				  "media": "\"abc-news.png\"",
				  "credit": "ABC News",
				  "caption": "\"\""
			   }
			},
			 {
			   "startDate": "2017,5,15",
			   "endDate": "2017,5,15",
			   "headline": "<strong>Trump prompted questions with a tweet about James Comey. Here are possible reasons why he won't clarify</strong>",
			   "page_rank": 1,
			   "text": "<p>(CNN) On Monday, White House press secretary Sean Spicer refused to offer any clarity on a simple but absolutely critical question: Is President Donald Trump taping phone calls he makes and receives? The President has nothing further on that,\" Spicer said at one point.\n\n\"The President's made clear that's what his position is,\" he said at another.\n\nThere's a number of problems with those responses but the most obvious is this: Trump has, in no way, shape or form made clear what his \"position\" is on taping phone calls.\n\nHere's the extent of Trump's \"position,\" which came in the form of a tweet last Friday morning: \"James Comey better hope that there are no 'tapes' of our conversations before he starts leaking to the press!\"\n\nJames Comey better hope that there are no \"tapes\" of our conversations before he starts leaking to the press!\n\nIn the 72 hours since that Trump tweet, the White House has provided absolutely zero guidance as to whether it was meant in jest or is, in fact, a reflection of what Trump is actually doing.\n\nReminder: At issue is whether the president of the United States is secretly taping phone calls -- including those with his now-deposed FBI director.\n\nThat's not a small deal or a side issue -- especially considering that the last time a president secretly taped phone calls, he wound up resigning ahead of an almost-certain impeachment.\n\nAnd yet, we get a single, vague tweet from the president of the United States followed by, well, nothing.\n\nLet's run through what could be going on here:\n\n1. Trump has a secret taping system\n\nIf this is right, then Trump can \"no comment\" and have his press people avoid the question all he wants but the tapes will eventually come out. Congress -- even a Republican-led one -- will make sure of that.\n\n2. Trump has no taping system but doesn't want to back down\n\nIt's possible that this \"tapes\" tweet is the second coming of Trump's earlier tweet insisting that he had information that President Barack Obama had ordered a wiretap of Trump Tower during the 2016 election . Despite everyone who is in a position to know saying publicly that no such wiretapping order was made, Trump continues to defend it -- now trying to elide his claim with the broader surveillance operations run by the National Security Agency. Trump simply doesn't like to admit he popped off or said something without proof. And he certainly doesn't want Spicer doing that from behind the podium.\n\n3. Spicer doesn't know whether Trump has a taping system\n\nPlausible deniability is a key component for every White House press secretary. Better to not be looped in than have to lie for the boss. Not only that but Spicer has never been in the Trump inner circle. So it's possible Spicer just plain doesn't know whether Trump is taping conversations -- and has no interest in finding out.\n\nOption No. 2 is the best one for Trump because, well, it's the only one in which he isn't secretly taping phone calls in the White House. But, regardless of the reasoning, it's virtually impossible for the White House to maintain their current position on the taping issue.\n\nTrump hasn't articulated a position. So Spicer referring back to Trump's past comment is useless. Reporters won't -- and shouldn't -- stop asking whether the most powerful person in the country has a secret taping system in the White House. And, eventually, Trump is going to have to answer that question -- or risk his presidency growing even more side-tracked than it already is.</p>",
			   "asset": {
				  "media": "\"cnn.png\"",
				  "credit": "CNN",
				  "caption": "\"\""
			   }
			},
			 {
			   "startDate": "2017,5,17",
			   "endDate": "2017,5,17",
			   "headline": "A Timeline of the Comey-Trump Clash",
			   "page_rank": 3,
			   "text": "<p>Mr. Trump and Mr. Comey have a private dinner a week after inauguration. In an account by Mr. Trump on May 11, Mr. Comey asks the president to keep his job and reassures Mr. Trump that he is not under investigation. Associates of Mr. Comey describe a far different conversation, in which Mr. Trump asks Mr. Comey to pledge his loyalty, and he demurs.</p>",
			   "asset": {
				  "media": "\"the-new-york-times.png\"",
				  "credit": "The New York Times",
				  "caption": "\"\""
			   }
			},
			 {
			   "startDate": "2017,5,17",
			   "endDate": "2017,5,17",
			   "headline": "Comey memo says Trump asked him to drop FBI investigation of Michael Flynn",
			   "page_rank": 1,
			   "text": "<p>The White House on Tuesday confronted what could be the most serious allegation to date against President Trump — reports that in February he asked the FBI director, James B. Comey, to drop an investigation of the president’s former national security advisor.\n\nComey, who was fired by Trump last week, wrote a memo shortly after the Oval Office encounter on Feb. 14 to make a record of Trump’s words, according to a close associate of his who had read the document and described it in an interview.\n\nComey wrote several other memos describing encounters with Trump that he found troubling, the associate said.\n\n“I hope you can see your way clear to letting this go, to letting Flynn go,” Trump told Comey, referring to the FBI investigation of Michael Flynn, according to the memo. “He is a good guy. I hope you can let this go.”\n\nThe existence of the memos was first reported by the New York Times.\n\nThe meeting between Trump and Comey took place one day after Flynn was fired as national security advisor. At the time, White House officials said the president had dismissed Flynn because he had lied to Vice President Mike Pence and other officials about his contacts with Russian Ambassador Sergey Kislyak.\n\nThe White House issued a statement Tuesday denying that Trump asked Comey to close the investigation of Flynn’s ties to Russia during the 2016 campaign, when Flynn was an advisor to Trump.\n\n\"While the president has repeatedly expressed his view that Gen. Flynn is a decent man who served and protected our country, the president has never asked Mr. Comey or anyone else to end any investigation,” the statement said.\n\nThe report on the Trump-Comey meeting raised serious questions about potential presidential interference in a criminal investigation. It prompted several Republicans to demand that Comey testify to Congress and seemed certain to complicate Trump’s efforts to pick a new head of the FBI or push major elements of his legislative agenda.\n\nTuesday night, Rep. Jason Chaffetz (R-Utah), the chairman of the House Oversight Committee, sent a letter to the FBI demanding that all memorandums, notes and recordings between Trump and Comey be delivered to his panel by next week.\n\n“I have my subpoena pen ready” if necessary, he said.\n\nThe news broke even as White House officials were still trying to grapple with another Russia-related controversy that had erupted the day before.\n\nThat involved Trump’s decision to share information with two Russian diplomats during an Oval Office meeting last week. On Monday, the Washington Post and the New York Times reported that Trump had disclosed highly classified information to the two Russians that a U.S. ally had provided on condition that it not be shared.\n\nThe White House had denied the accuracy of those news reports.\n\nBut on Twitter on Tuesday morning, Trump said he had, in fact, shared information with the two Russians, Kislyak and Foreign Minister Sergei Lavrov. He said he had an “absolute right” as president to do so.\n\nHis tweets, which confirmed much of the information in the stories, undermined the carefully crafted denials his aides had offered the day before.\n\nThe back-to-back controversies hit the White House as it was still trying to contain the damage from last week’s unexpected firing of Comey.\n\nAnd it all happened just days before Trump was scheduled to leave for his first overseas trip as president, an eight-day journey through the Mideast and Europe that already posed numerous potential problems for the administration.\n\nWhite House Press Secretary Sean Spicer, who conducted his briefing for reporters off-camera on Tuesday, brushed off a question about whether Trump, amid the furors, has been able to adequately prepare for meetings with foreign leaders. Trump, however, several times on Tuesday mispronounced the last name of Turkish President Recep Tayyip Erdogan, with whom he was meeting.\n\nThe new report on Trump’s February meeting with Comey added to the intense scrutiny over the president’s decision to fire the FBI director and raised the legal and political exposure for the administration.\n\nTrump’s aides initially said he fired Comey based on a Justice Department recommendation that criticized the FBI chief’s handling of the investigation into Hillary Clinton’s email practices as secretary of State. Trump contradicted that account days later in an interview with NBC News, saying that he had made up his mind to sack Comey before the recommendation and that he was thinking about “the Russia thing” when he made the decision.\n\nThe FBI since last summer has been investigating Russia’s meddling in the 2016 election and potential collusion by the Trump campaign — an investigation that Trump days ago decried as a waste of taxpayers’ money.\n\nWhite House officials began Tuesday by struggling to reconcile their earlier denials that Trump had disclosed classified information to the Russian officials with the president’s own acknowledgment that he’d done so.\n\n“It is wholly appropriate for the president to share whatever information he thinks is to the advancement of the security of the American people,” national security advisor H.R. McMaster told reporters.\n\nHe denied that Trump’s discussions with the Russians had endangered cooperation with the source of the intelligence, a U.S. ally, which the New York Times identified as Israel. .\n\nMcMaster said that Trump’s disclosure to the Russians was impromptu, not the sort of scripted talking point more typical of such diplomatic exchanges. He said the president was unaware of the source of the intelligence he shared. McMaster confirmed that the intelligence involved an Islamic State plot to use laptop computers as explosive devices aboard commercial aircraft.\n\nMcMaster also confirmed reports that after Trump’s meetings with the two Russians, the president’s counter-terrorism advisor, Thomas Bossert, was concerned enough by Trump’s disclosure to alert the National Security Agency and the CIA — “maybe from an overabundance of precaution,” McMaster said.\n\nMcMaster said he was “not concerned at all” that Trump’s disclosure had compromised intelligence-sharing relationships with allies. He said the details Trump discussed with the Russians were considered within the bounds of “what the expectations are of our intelligence partners.”\n\nTrump himself, in brief public comments during a joint appearance with Erdogan at the White House, suggested that his “very, very successful meeting” with the Russians had been intended to enlist their help in battling Islamic State in Syria. “Our fight is against ISIS,” he said, using an acronym for the militant group.\n\nTo date, however, Russia’s military efforts in Syria have been in support of the government of President Bashar Assad and against Syrian rebels fighting it, not in alliance with the U.S.-backed campaign against Islamic State.</p>",
			   "asset": {
				  "media": "\"la-times.png\"",
				  "credit": "Los Angeles Times",
				  "caption": "\"\""
			   }
			},
			 {
			   "startDate": "2017,5,19",
			   "endDate": "2017,5,19",
			   "headline": "Analysis: 'You're fired' may backfire. Untethered James Comey now Trump's greatest threat",
			   "page_rank": 3,
			   "text": "<p>CLOSE Skip in Skip x Embed x Share The White House is disputing a report that President Donald Trump asked former FBI Director James Comey to shut down an investigation into ousted national security adviser Michael Flynn. The New York Times says he made the request in February. (May 16) AP\n\nPresident Trump shakes hands with James Comey during an Inaugural Law Enforcement Officers and First Responders Reception in the Blue Room of the White House on Jan. 22, 2017. (Photo: Andrew Harrer, Pool/Getty Images)\n\nWASHINGTON — In business and now in politics, Donald Trump has proved himself time and again extraordinarily adept at vanquishing all comers.\n\nHis unlikely path to the White House is littered with would-be political challengers, whom he tattooed with disparaging monikers such as “Lyin' Ted Cruz’’ or “Crooked Hillary.’’ And of course, the real estate mogul is virtually synonymous with the catchphrase, \"You're fired!\"\n\nBut by firing the FBI director — who was running an ongoing investigation into possible collusion between his campaign associates and Russia — Trump has unleashed a formidable rival who may finally outdo him.\n\nAn untethered James Comey is now the single greatest threat to his young administration.\n\nExplosive revelations that Comey maintained secret files of his encounters with Trump, including a February meeting in which the president pressed Comey to shut down the FBI investigation of former national security adviser Michael Flynn, gives Comey even more power than he had as FBI director.\n\n\"I think the president wildly underestimated Comey and the organization of the FBI,\" said Ron Hosko, a former FBI assistant director who worked with Comey. \"Jim Comey represents a huge challenge to the viability of this president.\"\n\nThe bureau’s wide-ranging inquiry into Russia’s intervention is not close to completion, but less than 24 hours after the existence of the former director’s personal files was made public, the news sent a shiver through Congress unlike any of the recent crises that have engulfed the White House.\n\nLawmakers are now clamoring for Comey's notes or any recordings of the private conversations. At least four congressional committees — Senate Judiciary, Senate Intellingence, House Intelligence and House Oversight — have either requested documents, threatened subpoenas, or signaled that they will.\n\nRead more:\n\nAs Democrats raise the specter of possible \"obstruction of justice'' and impeachment, House Speaker Paul Ryan, R-Wis., early Wednesday acknowledged that a new congressional inquiry was necessary to understand the gravity of the Comey memos. (The intelligence committees in the House and Senate already are investigating Russia's interference in the 2016 election.)\n\nUtah Rep. Jason Chaffetz, the Republican chairman of the powerful House Oversight and Government Reform Committee who is leading the new probe, immediately offered a daunting assessment of the panel's new responsibility.\n\n\"If true, these memoranda raise questions as to whether the president attempted to influence or impede the FBI's investigation as it relates to Lt. Gen. Flynn,'' Chaffetz said in a letter requesting that the FBI provide the former director's notes by next Wednesday. Chaffetz has signaled he would be willing to subpoena the documents if necessary, and he has scheduled a May 24 hearing, though it was not clear whether Comey had committed to appearing.\n\nThe Senate Intelligence Committee on Wednesday requested that the former FBI director appear before its panel in public and closed sessions to discuss his contacts with Trump. The panel also requested testimony of acting FBI Director Andrew McCabe related to “any notes or memorandum prepared by the former director.’’\n\nOnce Comey's notes are in the hands of lawmakers, they are likely to feel pressure to take action.\n\n\"Based on what I know about Jim Comey, he was making notes about his meetings with Trump as soon as he got in the car or off the phone,\" Hosko said. \"And if the president thought he was going to use his charm to sway the focus of the Russia investigation, then he was very much mistaken.\"\n\nThe source who has reviewed Comey's notes said the documents are dated and detailed, including the account of his Feb. 14 encounter with Trump where the president reportedly urged Comey to back off its examination of Flynn. The former national security adviser had been fired the day before for lying about his communications with Russia ambassador Sergey Kislyak before the inauguration.\n\n\"I hope you can let this go,'' Trump allegedly told Comey in the private meeting. The FBI director was at the White House that day for a broader national security meeting, which included Vice President Mike Pence and Attorney General Jeff Sessions. Following that gathering, Trump asked Comey to remain for a one-on-one discussion where Comey alleged Flynn's status was raised.\n\nComey felt it necessary to keep contemporaneous notes of all his meetings and telephone calls with the president because he regarded Trump with particular suspicion, according to a person who has reviewed the former director's memos. The existence of the memos was first reported by The New York Times.\n\nIt is not clear how widely the documents were circulated within the bureau.\n\nNow that he's been fired, of course, the calculation to keep them under close hold might change: Trump has yet to appoint a new FBI director, and already questions are swirling as to whether that person will be able to take on the ongoing inquiry without bias.\n\nFormer FBI director James Comey walks at his home in McLean, Va., on May 10, 2017, a day after being fired by President Trump. (Photo: Sait Serkan Gurbuz, AP)\n\nIn the days after firing Comey, Trump called Russia investigation a \"made up story\" and said in an interview to NBC that it was indeed on his mind when he fired the FBI chief. That contradicted his administration's assertions and even his own widely disseminated termination letter stating the dismissal was based on the recommendations of Justice Department leadership, who objected to his handling of the Hillary Clinton email probe.\n\nAdding insult to injury, Trump called Comey – who only got the news he was fired through TV news reports at the Los Angeles bureau – a \"showboat\" and \"grandstander\" who led the agency into turmoil.\n\nWhile Comey's management of the Clinton email investigation was strongly criticized by members of both parties during the election, few have questioned his personal integrity.\n\nA career prosecutor, Comey held top Justice Department posts in the George W. Bush administration before being appointed FBI director by President Obama in 2013.\n\nComey has been widely lauded for his actions as deputy attorney general in the George W. Bush administration when he led a dramatic intervention in the hospital room of an ailing Attorney General John Ashcroft. Then-White House counsel Alberto Gonzales and chief of staff Andrew Card were pressing Ashcroft to renew a controversial warrantless wiretap program. When Comey and then-FBI director Robert Mueller threatened to resign, the White House relented.\n\nWith this kind of reputation as an independent straight shooter, it's likely members of Congress on both sides will take his accounts very seriously. Contemporaneous notes of events recorded by agents and investigators are often given strong consideration by courts, but it is not immediately known whether Comey specifically prepared them for use in the bureau's counter-intelligence inquiry involving Russia's election interference.\n\nTrump's credibility also could take a hit from memos detailing Comey's controversial Jan. 27 dinner with the Trump, according to the person who has reviewed them.\n\nThe president claimed in an NBC News interview last week that Comey requested the dinner as part of an appeal to keep his job as FBI director. Trump also claimed that during the course of the dinner, Comey assured him that he was not a target of the bureau's ongoing Russia probe.\n\nAfter skeptics of that account suggested that would have been highly unusual, or even inappropriate, for a director to give private assurances about the scope of an investigation, Trump later warned Comey against going public with any contradiction of the president's version of events, suggesting on Twitter that there were secret \"tapes\" of the encounter. The White House has refused to confirm or deny whether the president secretly records conversations.\n\nBut Comey's notes from that dinner meeting, according to the source familiar with them, do reflect that the president requested the FBI director's loyalty. The source said Comey pledged only honesty – and did not address Trump's status as a possible subject of the bureau's Russia investigation.\n\nThe White House has strongly disputed Comey's version of events, especially the memo involving Flynn.\n\n\"While the president has repeatedly expressed his view that General Flynn is a decent man who served and protected our country, the president has never asked Mr. Comey or anyone else to end any investigation, including any investigation involving General Flynn,\" the White House said in a statement.\n\n\"The president has the utmost respect for our law enforcement agencies, and all investigations,\" the White House said. \"This is not a truthful or accurate portrayal of the conversation between the president and Mr. Comey.”\n\nFormer Trump campaign aide Michael Caputo said the true opponent isn't actually Comey – but the so-called \"Never Trump\" political faction establishment using the alleged memo as an excuse to attack the president. \"It's not Comey who's flooding the zone, it is the anti-Trump zealots who are flooding the zone,\" Caputo said. \"It's a shame they're making Comey a pawn in their play.\"\n\nIf the FBI truly believed Trump was attempting to interfere inappropriately with the Russia investigation, Caputo said Comey should have made his concerns known about the Flynn conversation.\n\n\"If Comey did not report it up the chain of command, it means he did not think it was obstruction of justice,\" Caputo said. \"If he did, he would have been required by law to report it.\"\n\nCaputo said Trump has faced crises before and prevailed, most notably in the November election. \"I think Donald Trump is in for the fight of his life,\" he said, \"and I think he's up for it.\"\n\nThe Justice Department, meanwhile declined comment Wednesday on either lawmakers' new requests for memos or the accusations Trump interfered with the probe. Deputy Attorney General Rod Rosenstein is preparing for a Thursday briefing for the full Senate to outline last week's decision to dismiss the FBI director.\n\nRosenstein, just two weeks on the job, prepared the scathing three-page letter offering justification for Comey's dismissal. The deputy attorney general specifically cited Comey's controversial management of the FBI's inquiry into Hillary Clinton's use of a private email server while secretary of State — in which he publicly declared that the agency would not seek charges against the Democratic candidate in July, only to announce the reopening of the probe just 11 days before the November election.\n\nTrump later said he intended to fire Comey regardless of Rosenstein's recommendation. Still, the new disclosures about Comey's deep suspicion of Trump's motives are casting a sharper focus on the Justice Department leader's anticipated Senate appearance.\n\n\"Indeed, all of the circumstances surrounding Director Comey’s dismissal just as he was leading an investigation into ... the Trump campaign’s ties with Russia and President Putin’s interference with the 2016 election, have shaken public confidence in the (Justice) department, in your leadership, and in the administration of law and justice in our country,” Senate Minority Leader Chuck Schumer, D-N.Y., said in a letter to Rosenstein.\n\n“In order to restore the nation’s faith in you personally and in our law enforcement system more broadly, the American people must understand more about your role in the president’s firing of Director Comey.”\n\nMeanwhile, on Wednesday, with the news of notes now out in the open, Trump broke with his usual practice — and stayed quiet.\n\nHe did not tweet about the Comey memos in the 18 hours after news reports broke. And he steered clear of the topic at his commencement address at the U.S. Coast Guard Academy.\n\nHe did, however, insist that \"no politician in history\" has been \"treated worse or more unfairly\" than he has.\n\nEven as he blasted the media coverage, and threats from his critics, Trump struck a defiant tone. \"You can't let them get you down,\" Trump told the cadets. \"Adversity makes you stronger. Don't give in, don't back down.\"\n\nRead or Share this story: https://usat.ly/2rrGBdq</p>",
			   "asset": {
				  "media": "\"usa-today.png\"",
				  "credit": "USA Today",
				  "caption": "\"\""
			   }
			},
			 {
			   "startDate": "2017,6,3",
			   "endDate": "2017,6,3",
			   "headline": "Comey has not received executive privilege notice from Justice Department",
			   "page_rank": 1,
			   "text": "<p>Former FBI Director James Comey has not received a notice regarding executive privilege from the Justice Department ahead of his scheduled testimony before the Senate Intelligence Committee next week, a Comey associate tells CBS News.\n\nThe associate says Comey still wants to testify and provide the \"relevant facts\" to the committee, CBS News correspondent Jeff Pegues reports.\n\nWhite House press secretary Sean Spicer was asked Friday if President Trump would invoke executive privilege to prevent Comey from speaking.\n\n\"I have not spoken to counsel yet,\" Spicer said. \"I don't know ... how they're going to respond.\"\n\nSome legal scholars believe any notice would be legally dubious, and the committee itself may resist any invocation of executive privilege.\n\nThe developments come shortly after Russian President Vladimir Putin mocked U.S. investigators Friday, questioning whatever proof may exist that his government was behind the U.S. election hacks.\n\n\"Which fingerprints?\" Putin asked. \"IP addresses can be completely made up and sent from your home address by your children.\"\n\nWhile Putin has been talking, Russian banker Sergey Gorkov has not.\n\nGorkov, who heads Russian investment bank VEB, had a secret meeting with Mr. Trump's son-in-law Jared Kushner in December in New York.\n\nThe White House said Kushner \"was acting as a transition official\" by taking the meeting. Sources say the two men discussed setting up a secret back channel between the Trump team and the Russian government.\n\nBut VEB told the New York Times Mr. Gorkov met with Kushner in his capacity as a real estate executive.\n\nWhether the meeting was about business or politics, critics say it raises questions.\n\n\"The appearances here look really not very good for Mr. Kushner,\" Tim Frye, a Russia scholar at Columbia University, said.\n\nFrye said Putin likely know about the meeting between Kushner and Gorkov.\n\n\"I think it would take extraordinary gumption for the head of a state-owned bank in Russia to engage in diplomacy at this level without at least some support from the Kremlin,\" Frye said.\n\nThe meeting is now part of special counsel Robert Mueller's investigation into whether Trump associates colluded with the Russians during the 2016 election.\n\nMueller was selected to lead the probe after it was revealed that Comey had written memos about his meetings with Mr. Trump. Sources say one said that Mr. Trump asked Comey to drop his investigation into fired National Security Adviser Michael Flynn.\n\nComey is set to testify before Congress about that memo next Thursday.</p>",
			   "asset": {
				  "media": "\"cbs-news.png\"",
				  "credit": "CBS News",
				  "caption": "\"\""
			   }
			},
			 {
			   "startDate": "2017,6,7",
			   "endDate": "2017,6,7",
			   "headline": "<strong>Cilizza:</strong> James Comey just went nuclear on Donald Trump",
			   "page_rank": 2,
			   "text": "<p>(CNN) James Comey's written testimony regarding his interactions with President Donald Trump regarding the Russia investigation blow a massive hole in the story the president has been telling about the duo's interactions.\n\nThe testimony, which Comey is set to deliver Thursday in one of the most highly-anticipated Congressional hearing in decades, reads like a point-by-point dismissal of Trump's version of events -- casting Comey as wary from the get-go of a chief executive who seemed to presume too much and know too little.\n\nIn the wake of their first interaction, ever, on January 6, Comey decided that it was necessary to have written documentation of any time he spent with Trump.\n\nWrites Comey:\n\n\"I felt compelled to document my first conversation with the President-Elect in a memo. To ensure accuracy, I began to type it on a laptop in an FBI vehicle outside Trump Tower the moment I walked out of the meeting. Creating written records immediately after one-on-one conversations with Mr. Trump was my practice from that point forward. This had not been my practice in the past. I spoke alone with President Obama twice in person (and never on the phone) -- once in 2015 to discuss law enforcement policy issues and a second time, briefly, for him to say goodbye in late 2016. In neither of those circumstances did I memorialize the discussions. I can recall nine one-on-one conversations with President Trump in four months -- three in person and six on the phone.\"\n\nRead between the lines there. From the day he met Trump, Comey felt the need to always document everything they talked about -- a practice he had never undertaken with President Obama. And, more amazingly, Comey recalls that he had two one-on-one conversations with Obama in four years; he had nine(!) one-on-one conversations with Trump between Jan. 6 and when he was fired on May 9. Nine\n\nIt only gets worse from there for Trump in Comey's opening statement.\n\nComey says that he was surprised to learn that a dinner invitation extended to him by Trump on Jan. 27 was for just the two of them (\"It turned out to be just the two of us, seated at a small oval table in the center of the Green Room,\" Comey writes. \"Two Navy stewards waited on us, only entering the room to serve food and drinks.\") and that the goal of the meeting was \"an effort to have me ask for my job and create some sort of patronage relationship.\"\n\nTwice in that meeting Trump, recounted Comey, made a direct request for loyalty from the FBI director. \"I need loyalty, I expect loyalty,\" Trump told Comey. Later, he returned to the subject. Here's Comey's recollection:\n\n\"He then said, 'I need loyalty.' I replied, 'You will always get honesty from me.' He paused and then said, 'That's what I want, honest loyalty.' I paused, and then said, 'You will get that from me.'\"\n\nComey also confirmed in his written testimony that Trump directly asked him to \"let go\" of the investigation into deposed national security adviser Michael Flynn. Quoting Trump, Comey writes of the Feb. 14 meeting in the Oval Office: \"I hope you can see your way clear to letting this go, to letting Flynn go. He is a good guy. I hope you can let this go.\"\n\nI mean. Holy crap.\n\nThen there is this, from Comey's after-action report of that meeting: \"I had understood the President to be requesting that we drop any investigation of Flynn in connection with false statements about his conversations with the Russian ambassador in December.\"\n\nWhile Comey noted that he did not believe Trump was asking for the entire Russia investigation to disappear, that the sitting FBI director did believe the sitting president was asking to have a federal investigation of any sort dropped is, well, stunning.\n\nIn their final conversation -- a phone call from Trump to Comey on April 11 -- the president again sought to secure Comey's loyalty, according to the former FBI Director's re-telling.\n\nAfter Comey tells Trump that he should contact the deputy Attorney General's office in regards to his repeated request to \"get out\" the news that he was not a target of the federal investigation, here's how Comey remembers the president's response:\n\n\"He said he would do that and added, 'Because I have been very loyal to you, very loyal; we had that thing you know.' I did not reply or ask him what he meant by 'that thing.' I said only that the way to handle it was to have the White House Counsel call the Acting Deputy Attorney General. He said that was what he would do and the call ended.\"\n\n\"We had that thing you know.\"\n\nIf there is a single sentence that will become the symbol of Comey's testimony -- or even of Trump's broader interactions with the FBI director -- it's that. Trump trying to establish some rapport or, really, some sense of \"you owe me\" while Comey stares blankly.\n\nThe broader picture presented by Comey's testimony is deeply damaging to Trump.\n\nThat Trump and Comey had nine one-on-one conversations in the space of just over three months -- as opposed to the two one-on-one chats Comey had with Obama in eight years -- is hugely telling. And, in those conversations Trump is repeatedly cast as attempting to secure Comey's loyalty -- and, at times, suggesting his job depends on it. (FBI directors are appointed for 10 year terms but, as we know, can be fired at any time by a president.) That he asks for Comey to end the probe into Flynn is, at minimum a massive breach of protocol.\n\nTrump and his allies will work to dismiss Comey's testimony -- and his answers in front of the Senate Intelligence Committee tomorrow -- as, at best, a \"he said, he said\" situation and, at worst, \"fake news.\"</p>",
			   "asset": {
				  "media": "\"cnn.png\"",
				  "credit": "CNN",
				  "caption": "\"\""
			   }
			},
			 {
			   "startDate": "2017,6,8",
			   "endDate": "2017,6,8",
			   "headline": "White House Greatest threat ahead of Comey testimony? Trump",
			   "page_rank": 3,
			   "text": "<p>Concerns mount over what former FBI chief will reveal and Trump’s probable legally unvetted tweets about it, as administration struggles to build defense\n\nWhite House staff will be braced on Thursday not only for potentially devastating testimony from James Comey, the former director of the FBI, but for their boss’s blistering responses on Twitter.\n\nDonald Trump might live-tweet during the blockbuster hearing on Capitol Hill, the Washington Post has reported, just as he did when Comey appeared before the House intelligence committee in March.\n\nAt a time when White House officials ought to be shoring up defences and digging in, they instead find themselves scrambling to clean up one self-inflicted crisis after another. Plans for a so-called “war room” to deal with the Russia investigation appear to have collapsed, and four top law firms have reportedly turned down offers to represent Trump.\n\nJames Comey Senate testimony: America braces for a historic political moment Read more\n\n“If they’re mounting a united front, they’d better get moving,” said Rich Galen, a Republican strategist. “I’m not even sure they know where the front is.”\n\nThursday’s hour of reckoning at the Senate intelligence committee could be a turning point in the saga of Russia and last year’s presidential election. Comey is likely to be asked whether Trump pressured him to quash an investigation into the former national security adviser Michael Flynn’s links with Moscow, which could be tantamount to obstruction of justice. It is a national spectacle that will be covered by the big three TV networks but, unlike during past landmark hearings such as Watergate in 1973, Iran-Contra in 1987 and Clarence Thomas’s supreme court confirmation in 1991, the current president can fight back with his mobile phone.\n\nTrump has 31.7 million followers on Twitter and, the Washington Post reported, about 93.1 million followers across all his social media accounts (not the 110 million claimed by White House press secretary Sean Spicer).\n\nEven by his own wayward standards, Trump has gone rogue on Twitter this week, causing potential legal problems by using the term “travel ban”, lashing out at the mayor of London after a terrorist attack and criticising Qatar, a US ally, over terrorism. The impulsive barrage has derailed his team’s efforts to regain balance by devoting the week to an ambitious infrastructure programme while redirecting questions on the Russia investigation to an outside lawyer.\n\nOn Thursday, Trump will hold more meetings on infrastructure and address religious conservatives at a conference in Washington, making for a potentially dramatic split TV screen with Comey. “The president’s got a full day on Thursday,” Spicer told reporters. “The president’s going to have a very, very busy day and, as he does all the time, I think his focus is going to be on pursuing the agenda and priorities that he was elected to do.”\n\nBut the potential for disruptive, legally unvetted tweets remains. Galen observed: “That’s what he does. We all know people who don’t have the filter when it comes into your head and it doesn’t have to come out of your mouth. With Trump, it comes into his head and it has to come out in his fingers and phone.”\n\nI don’t think Trump has a strategic bone in his body. He is all tactical, all the time GOP strategist Rich Galen\n\nGalen dismissed the notion that the president could be deliberately using Twitter to distract attention from his other troubles. “I don’t think Trump has a strategic bone in his body. He is all tactical all the time.”\n\nTrump abruptly fired Comey last month, starting a chain reaction that led the justice department to name a special counsel, Robert Mueller, to lead its investigation into possible collusion between the Trump campaign and Russia. The president’s chief lawyer in charge of the case is Marc Kasowitz, a civil litigator who has long worked for Trump in business and public relations disputes in New York but has little experience in Washington.\n\nHopes of reinforcements have been dashed, however. Top lawyers with at least four major law firms have turned down requests to represent Trump, Michael Isikoff, a leading investigative journalist, reported on Tuesday. The lawyers cited a number of reasons, ranging from prior commitments and conflicts of interest to anxieties that the president would be unwilling to heed their advice or tarnish their public image, Isikoff wrote for Yahoo News.\n\nHe told MSNBC’s The Rachel Maddow Show: “It was extraordinary that there was concern about reputational risk to their firms. Would taking on the representation of Donald Trump, such a polarising figure, kill recruitment of top-notch legal talent coming out of law firms, or how would it play with their existing clients? And that’s really an extraordinary thing when you’re talking about representing the president of the United States.”\n\nThe mood in the White House has reportedly plummeted and taken on an “it’s us against the world” quality in recent weeks. There were said to be plans for a “war room” – modelled on Bill Clinton’s rapid response unit that dealt with Monica Lewinsky-related inquiries – involving Trump campaign veterans such as David Bossie and Corey Lewandowski. But the process has been bogged down by a lack of decision-making over how to proceed, the Associated Press reported, as well as reluctance from would-be recruits about serving a president who is his own worst enemy.\n\nThe Guardian view on America’s Russia investigation: watershed or Watergate? | Editorial Read more\n\nRick Tyler, a political analyst and co-founder of consulting firm Foundry Strategies, said: “I keep hearing there’s a war room but I never hear any more details about it. I don’t get the sense this is a White House united in purpose or direction because it doesn’t know which way is up most days. The president routinely undermines his own talking points and his own communications staff. You can only do that for so long until trust is worn down and it becomes a farce.”\n\nTyler warned that Trump is in for a rough ride if Comey views this as a moment of reckoning. “I think I saw [Senator] Roy Blunt subtly try to undermine Comey’s credibility but I’m not sure it’s going to work. When it comes to truth and credibility, I think Comey has a huge advantage there. This is going to be a test of who’s telling the truth.”\n\nThe former FBI director’s testimony is likely to be another divisive moment in partisan Washington. Trump’s critics are unsurprised by the chaotic preparations at the White House. Charles Chamberlain, executive director of the progressive group Democracy for America, said: “We have a president who is such a megalomaniac he just can’t stop himself. He has to spill his political vomit as far as he can.”\n\nHe added: “This is an incredibly corrupt, dangerous administration and the only way to hold it accountable is to begin impeachment proceedings.”\n\n</p>",
			   "asset": {
				  "media": "\"the-guardian-us.png\"",
				  "credit": "Guardian US",
				  "caption": "\"\""
			   }
			},
			 {
			   "startDate": "2017,6,8",
			   "endDate": "2017,6,8",
			   "headline": "The Latest: Comey says he worried Trump would 'lie'",
			   "page_rank": 1,
			   "text": "<p>WASHINGTON (AP) — The Latest on developments involving fired FBI Director James Comey (all times EDT):\n\n___\n\n11:12 a.m.\n\nFired FBI Director James Comey says, \"Lordy, I hope there are tapes,\" of his conversations with President Donald Trump.\n\nThree days after Trump fired Comey, the president tweeted that Comey should hope there are \"no tapes\" of their conversations.\n\nComey documented his conversations with Trump in memos after the encounters. During his first public appearance since he was fired, senators asked Comey about his responses to Trump.\n\nComey says he chose his words carefully when responding to Trump because he was \"so stunned\" by the conversation. Comey was recalling a February conversation in which, Comey says, Trump said he hoped Comey could let go the FBI's investigation into Trump's first national security adviser Michael Flynn's calls with the Russians.\n\n___\n\n11:06 a.m.\n\nPresident Donald Trump has so far stayed off Twitter during former FBI Director James Comey's testimony. But his eldest son hasn't.\n\nDonald Trump Jr. is posting repeatedly during the closely watched testimony Thursday.\n\nHe repeatedly defended his father and attacked Comey.\n\nTrump Jr. in particular seized on Comey's assertion that he interpreted the president's statement that he \"hoped\" the FBI would drop its probe into former National Security Adviser Michael Flynn.\n\nTrump Jr. tweeted \"you would think a guy like Comey\" would know the difference between \"hoping and telling.\"\n\nHe also cast doubt on all of Comey's testimony and said he should \"have actually followed procedure.\"\n\nDonald Trump Jr. and his brother Eric are now at the helm of their father's New York-based business.\n\n___\n\n11:00 a.m.\n\nFormer FBI director James Comey says he took \"as a direction\" President Donald Trump's remark that he hoped Comey would drop an investigation into former National Security Adviser Michael Flynn.\n\nRepublican Sen. James Risch of Idaho asked if Comey was aware of anyone being charged with obstruction of justice because they expressed hope for a certain outcome. Comey says he wasn't.\n\nBut Comey added at his Senate hearing: \"I took it as a direction,\" and noted that the remark came during a one-on-one meeting with the president of the United States.\n\n___\n\n10:50 a.m.\n\nFormer FBI director James Comey says he thought during a January dinner with President Donald Trump that the president was \"looking to get something\" in exchange for allowing him to stay on as FBI director.\n\nComey is describing his views that the president was trying to create a type of \"patronage relationship\" at the start of the Trump administration.\n\nThe ousted FBI head is testifying that the president told him before the dinner he hoped he would stay as director.\n\nComey says law enforcement leaders aren't \"supposed to be peeking out to see whether your patron is pleased or not with what you're doing.\"\n\n___\n\n10:40 a.m.\n\nFormer FBI Director James Comey says he was concerned Donald Trump would \"lie\" about the nature of his first conversation with him.\n\nComey says Trump's behavior was new to him and led him to think, \"I gotta write it down and I gotta write it down in a very detailed way.\"\n\nDuring the meeting, Trump asked if he personally was under investigation. Comey says he told him he was not at that time.\n\nTrump fired Comey in May. At the time, Comey was leading an investigation into Russia's election meddling and ties with the Trump campaign.\n\n___\n\n10:35 a.m.\n\nFormer FBI Director James Comey says that former Attorney General Loretta Lynch urged him to refer to the investigation into Hillary Clinton's emails a \"matter\" instead of an \"investigation.\"\n\nComey says in his Senate Intelligence Committee hearing that he was confused by the request and it was one of the reasons he felt the need to publicly announce his findings in the Clinton email case.\n\nComey says the other major factor was Lynch's meeting with former President Bill Clinton on the tarmac of an Arizona airport. Comey says he had to announce his findings to protect the credibility of the FBI and the Justice Department.\n\n__\n\n10:25 a.m.\n\nJames Comey says President Donald Trump's administration spread \"lies, plain and simple\" and \"defamed\" him and the FBI.\n\nThe former FBI director opened his Senate testimony Thursday by stating that the administration's explanations for his firing confused and concerned him.\n\nThe ousted FBI director says at the start of his high-profile Senate hearing that President Donald Trump had repeatedly told him he was doing a great job. Comey says he told the president he planned to serve out his full 10-year term.\n\nComey is testifying before the Senate intelligence committee. His remarks are his first public statements since his firing on May 9, which came as he was leading an FBI investigation into potential coordination between Russia and the Trump campaign.\n\n___\n\n10:20 a.m.\n\nFormer FBI director James Comey says that shifting explanations of his firing confused and concerned him.\n\nThe ousted FBI director says at the start of his high-profile Senate hearing that President Donald Trump had repeatedly told him he was doing a great job. Comey says he told the president he planned to serve out his full 10-year term.\n\nComey says he was \"confused\" by the explanation that his decisions during the 2016 election was the reason he was fired by Trump.\n\n___\n\n10:18 a.m.\n\nFormer FBI Director James Comey has begun his much-anticipated congressional testimony under oath.\n\nComey is expected to recount a series of interactions with President Donald Trump in the weeks before his firing that he will say made him uncomfortable.\n\nThose include a January dinner in which he says Trump asked him for his loyalty, and a White House conversation weeks later in which he says Trump asked him to end an investigation into former national security adviser Michael Flynn.\n\nComey is testifying before the Senate intelligence committee. His remarks are his first public statements since his firing on May 9, which came as he was leading an FBI investigation into potential coordination between Russia and the Trump campaign.\n\n___\n\n10:15 a.m.\n\nDemocratic Sen. Mark Warner says President Donald Trump's pressuring of former FBI Director James Comey and other government officials to downplay the Russia investigation is inappropriate.\n\nWarner says it's not \"how a president of the United States behaves.\"\n\nWarner, of Virginia, is the top Democrat on the Senate intelligence committee. The panel is hosting Comey for his first public account of his interactions with the president before he was dramatically fired.\n\nIn his prepared opening remarks, Comey describes a series of uncomfortable interactions with the president.\n\n___\n\n10:10 a.m.\n\nPresident Donald Trump will dispute key parts of former FBI Director James Comey's testimony.\n\nThat's according to a person close to the president's legal team.\n\nThe person says the president disputes Comey's claim that he asked him for loyalty. Trump also disputes Comey's account of a conversation about the investigation into former National Security Adviser Mike Flynn.\n\nThe person demanded anonymity because the person is not authorized to be named in a discussion about legal strategy.\n\n—Julie Bykowicz\n\n___\n\n10:00 a.m.\n\nFormer FBI Director James Comey has arrived in a Senate hearing room where he will deliver long-awaited testimony about his dramatic firing.\n\nSenators will ask Comey about his interactions with President Donald Trump before he was fired in May.\n\nComey says he had a series of uncomfortable conversations with Trump. He says Trump asked him for a pledge of loyalty and pushed him to \"lift the cloud\" of the Russia investigation by declaring publicly the president was not the target of the probe into his campaign's ties with Moscow.\n\nComey's remarks are his first since he was fired.\n\n___\n\n9:52 a.m.\n\nPresident Donald Trump's outside counsel Marc Kasowitz will be at the White House Thursday to monitor fired FBI Director James Comey's testimony to Congress.\n\nThe president is expected to watch some of Comey's remarks to lawmakers. His public schedule is largely clear until the afternoon.\n\nKasowitz is a longtime Trump lawyer. He was recently tapped to handle all inquiries related to the investigations into possible ties between Trump's campaign and Russia — a move intended to distance the White House from the FBI and congressional probes.\n\n___\n\n7:30 a.m.\n\nThe ranking Democrat on the Senate intelligence committee says former FBI director James Comey's account of his conversations with the president about the Russia investigation are \"disturbing.\"\n\nSen. Mark Warner of Virginia will emphasize at Thursday's committee hearing that the American people need to realize that what happened was that a president asked an FBI director to drop an ongoing investigation into a former national security adviser.\n\nWarner released excerpts of his opening remarks to the committee early Thursday ahead of the hearing.\n\nWarner says that in violation of clear guidelines put in place after Watergate to prevent any whiff of political interference by the White House in FBI investigations, President Donald Trump also called Comey twice to ask him to lift the cloud of the Russia investigation over his White House.\n\n___\n\n6:45 a.m.\n\nA Senate Democrat is cautioning members of Congress against asserting too hastily that President Donald Trump has engaged in acts that could constitute obstruction of justice in the investigation of Russian meddling in last year's election.\n\nSen. Chris Coons of Delaware says, \"I think we have to be careful about making legal conclusions\" and argues that lawmakers should not be \"getting in the way\" of the investigation by special counsel Robert Mueller (MUHL'-ur).\n\nBut Coons also tells MSNBC in an interview, hours before fired FBI Director James Comey's Capitol Hill appearance, that he believes Trump's words and deeds go \"right up to the line\" of legality. The senator adds that statements about the Russia probe attributed to Trump by Comey raise the question of whether the president's actions \"meet the legal standard for obstruction of justice.\"\n\n___\n\n6:05 a.m.\n\nThe top Democrat on the House intelligence committee says former FBI Director James Comey's testimony on President Donald Trump's conduct \"is certainly evidence of interference or obstruction.\"\n\nComey is testifying Thursday that Trump urged him to back off from his investigation into Michael Flynn's contacts with Russians. Comey's written statement released ahead of his testimony said Trump had described the Russia investigation as a \"cloud\" that was interfering with his job. Comey is testifying that he gave Trump no such assurance. Trump fired him last month.\n\nRep. Adam Schiff, a California Democrat, made his assessment Wednesday in an interview with The Washington Post. Schiff added that even if Trump's actions met the legal test for obstruction, in practical terms it was less likely that the Republican-controlled Congress would move to remove him.\n\n___\n\n3:45 a.m.\n\nIn a hugely anticipated hearing, fired FBI director James Comey will recount a series of conversations with President Donald Trump that he says made him deeply uneasy and concerned about the blurring of boundaries between the White House and a law enforcement agency that prides itself on independence.\n\nThe testimony, Comey's first public statements since his May 9 dismissal, is likely to bring hours of uncomfortable attention to an administration shadowed for months by an investigation into ties between the Trump campaign and Russia.\n\nHis account of demands for loyalty from the president, and of requests to end an investigation into an embattled adviser, are likely to sharpen allegations that Trump improperly sought to influence the FBI-led probe.</p>",
			   "asset": {
				  "media": "\"associated-press.png\"",
				  "credit": "Associated Press",
				  "caption": "\"\""
			   }
			},
			 {
			   "startDate": "2017,6,8",
			   "endDate": "2017,6,8",
			   "headline": "Live stream: James Comey testimony before Senate Intelligence Committee",
			   "page_rank": 1,
			   "text": "<p>Former FBI director James Comey is sworn-in before a hearing in front of the Senate Intelligence Committee in Washington. (Photo: Jack Gruber, USA TODAY)\n\nDuring a highly anticipated hearing, former FBI Director James Comey will give what could be explosive testimony to the Senate Intelligence Committee. Comey was abruptly fired by President Trump in early May, in the midst of a widening investigation into possible collusion between Trump associates and Russia. Watch live in the player above at 10:00 a.m. ET Thursday to see Comey share his side of the story and answer senators' questions.\n\nComey confirmed Wednesday that President Trump requested his loyalty and later urged him to drop the investigation into ex-national security adviser Michael Flynn, according to a preview of his opening statement. Comey describes one meeting at the White House in which he said Trump strongly defended Flynn, saying that his former national security adviser “hadn’t done anything wrong’’ in his prior contact with Russian ambassador Sergey Kislyak. “I hope you can see your way clear to letting this go,’’ Comey said, quoting the president. “He is a good guy. I hope you can let this go.’’\n\nComey is expected to speak more on this encounter with the president, as well as at least nine others he outlines in his opening statement.\n\nHere is how we'll be providing coverage today:\n\nHere are live updates on today's hearing\n\nWe are live tweeting the here: @usatodayDC\n\nWe are also live streaming on Facebook at this post.\n\nNews from today's hearing:\n\nPresident Trump is not tweeting about the Comey hearing. But Donald Jr. is.\n\nKey takeaways from the James Comey testimony\n\nFired U.S. attorney Preet Bharara attends the Comey hearing\n\n'House of Cards' tweets Frank Underwood gif during Comey hearing\n\nSkip in Skip x Embed x Share CLOSE FORMER FBI DIRECTOR JAMES COMEY TESTIFIES BEFORE CONGRESS Comey on FBI disarray: 'Those were lies' | 0:27 Former FBI Director James Comey told the Senate Intelligence Committee that any claims that FBI was poorly led were \"plain and simple\" lies. USA TODAY 1 of 11 Skip in Skip x Embed x Share CLOSE FORMER FBI DIRECTOR JAMES COMEY TESTIFIES BEFORE CONGRESS Can't watch James Comey's testimony? Twitter's got you covered | 1:20 Former FBI Director James Comey’s big day is here. Angeli Kakade (@angelikakade) has the story. Buzz60 2 of 11 Skip in Skip x Embed x Share CLOSE FORMER FBI DIRECTOR JAMES COMEY TESTIFIES BEFORE CONGRESS Raw: People line up for Comey Senate testimony | 0:49 People began lining up outside the Hart Senate Building in Washington, DC on Thursday morning, hoping to watch former FBI Director James Comey's testimony to the Senate Intelligence Committee in person. (June 8) AP 3 of 11 Skip in Skip x Embed x Share CLOSE FORMER FBI DIRECTOR JAMES COMEY TESTIFIES BEFORE CONGRESS D.C. bar hosting 'Covfefe' viewing party for James Comey's testimony | 1:00 Former FBI Director James Comey’s testimony to Congress on Thursday is one of the most highly anticipated events in politics. Veuer's Nick Cardona (@nickcardona93) has that story. Buzz60 4 of 11 Skip in Skip x Embed x Share CLOSE FORMER FBI DIRECTOR JAMES COMEY TESTIFIES BEFORE CONGRESS James Comey to testify Trump asked to lift 'Russia cloud' | 0:49 Fired FBI director James Comey to testify Thursday. Buzz60 5 of 11 Skip in Skip x Embed x Share CLOSE FORMER FBI DIRECTOR JAMES COMEY TESTIFIES BEFORE CONGRESS Capitol Hill: Sparring previews Comey's testimony | 2:25 Ex-FBI Director James Comey will testify under oath Thursday that President Donald Trump repeatedly pressed him for his 'loyalty' and directly pushed him to 'lift the cloud' of investigation shadowing his White House. (June 7) AP 6 of 11 Skip in Skip x Embed x Share CLOSE FORMER FBI DIRECTOR JAMES COMEY TESTIFIES BEFORE CONGRESS D.C. bar pouring free drinks every time Trump tweets about Comey | 0:57 How many free Drinks does a Trump tweet get you? Angeli Kakade (@angelikakade) has the story. Buzz60 7 of 11 Skip in Skip x Embed x Share CLOSE FORMER FBI DIRECTOR JAMES COMEY TESTIFIES BEFORE CONGRESS Comey says Trump asked for 'loyalty' | 0:53 In his opening statement, former FBI director James Comey said Trump requested 'loyalty' and urged him to drop the FBI's Michael Flynn investigation. USA TODAY 8 of 11 Skip in Skip x Embed x Share CLOSE FORMER FBI DIRECTOR JAMES COMEY TESTIFIES BEFORE CONGRESS Washington Braces As Comey Prepares to Testify | 1:43 Washington is bracing for a high-profile hearing Thursday, when fired Federal Bureau of Investigations (FBI) Director James Comey is due to testify on Capitol Hill. (June 6) AP 9 of 11 Skip in Skip x Embed x Share CLOSE FORMER FBI DIRECTOR JAMES COMEY TESTIFIES BEFORE CONGRESS Top 3 controversial James Comey moments | 2:00 Take a glance at the former FBI Director's roller coaster career in Washington. USA TODAY 10 of 11 Skip in Skip x Embed x Share CLOSE FORMER FBI DIRECTOR JAMES COMEY TESTIFIES BEFORE CONGRESS Trump will apparently be busy during James Comey's testimony | 0:51 The White House is saying President Donald Trump will be ‘very, very busy’ during former FBI Director James Comey's testimony on Thursday. Buzz60 11 of 11 Last VideoNext Video Comey on FBI disarray: 'Those were lies'\n\nCan't watch James Comey's testimony? Twitter's got you covered\n\nRaw: People line up for Comey Senate testimony\n\nD.C. bar hosting 'Covfefe' viewing party for James Comey's testimony\n\nJames Comey to testify Trump asked to lift 'Russia cloud'\n\nCapitol Hill: Sparring previews Comey's testimony\n\nD.C. bar pouring free drinks every time Trump tweets about Comey\n\nComey says Trump asked for 'loyalty'\n\nWashington Braces As Comey Prepares to Testify\n\nTop 3 controversial James Comey moments\n\nTrump will apparently be busy during James Comey's testimony\n\nRead or Share this story: https://usat.ly/2rZgmhX</p>",
			   "asset": {
				  "media": "\"usa-today.png\"",
				  "credit": "USA Today",
				  "caption": "\"\""
			   }
			}
		]
    }
}